export const instructions = [
	'Предположим, что после соответствующего обучения вы сможете выполнять любую работу. В каждой из предложенных пар специальностей надо выбрать одну, которую вы считаете более подходящей для вас.',
	'Данные вопросы касаются вашего отношения к различным направлениям деятельности. Нравится ли вам делать то, о чем говориться в опроснике? Тогда просто выберите "да" или "нет"',
	'Оцените применимость к себе каждого из приведенных ниже утверждений. ',
]

export const test1key = [
	[0, 45],
	[1, 46],
	[2, 47],
	[3, 48],
	[4, 49],
	[5, 50],
	[6, 51],
	[7, 52],
	[8, 53],
	[9, 54],
	[10, 55],
	[11, 56],
	[12, 57],
	[13, 58],
	[14, 59],
	[15, 60],
	[16, 61],
	[17, 62],
	[18, 63],
	[19, 64],
	[20, 65],
	[21, 66],
	[22, 67],
	[23, 68],
	[24, 69],
	[25, 70],
	[26, 71],
	[27, 72],
	[28, 73],
	[29, 74],
	[30, 75],
	[31, 76],
	[32, 77],
	[33, 78],
	[34, 79],
	[35, 80],
	[36, 81],
	[37, 82],
	[38, 83],
	[39, 84],
	[40, 85],
	[41, 86],
	[42, 87],
	[43, 88],
	[44, 89],
]

export const speciality = [
	{
		code: 2,
		name: 'Археолог',
	},
	{
		code: 3,
		name: 'Специалист по связям с общественностью',
	},
	{
		code: 4,
		name: 'Нотариус',
	},
	{
		code: 2,
		name: 'Географ',
	},
	{
		code: 2,
		name: 'Метеоролог',
	},
	{
		code: 1,
		name: 'Фармацевт',
	},
	{
		code: 4,
		name: 'Налоговый инспектор',
	},
	{
		code: 1,
		name: 'Шеф-повар',
	},
	{
		code: 5,
		name: 'Начальник стройки',
	},
	{
		code: 1,
		name: 'Геолог-нефтяник',
	},
	{
		code: 3,
		name: 'Спасатель',
	},
	{
		code: 5,
		name: 'Маркетолог',
	},
	{
		code: 3,
		name: 'Тренер-инструктор',
	},
	{
		code: 1,
		name: 'Машинист электропоезда',
	},
	{
		code: 6,
		name: 'Студийный фотограф',
	},
	{
		code: 2,
		name: 'Искусствовед',
	},
	{
		code: 3,
		name: 'Гид-переводчик',
	},
	{
		code: 4,
		name: 'Спортивный арбитр',
	},
	{
		code: 5,
		name: 'Руководитель предприятия',
	},
	{
		code: 2,
		name: 'Редактор научной литературы',
	},
	{
		code: 3,
		name: 'Врач-нарколог',
	},
	{
		code: 1,
		name: 'Водолаз',
	},
	{
		code: 2,
		name: 'Ученый-экономист',
	},
	{
		code: 2,
		name: 'Инженер-конструктор',
	},
	{
		code: 6,
		name: 'Поэт-переводчик',
	},
	{
		code: 4,
		name: 'Судья',
	},
	{
		code: 1,
		name: 'Инженер-испытатель двигателей',
	},
	{
		code: 3,
		name: 'Инструктор по фитнесу',
	},
	{
		code: 4,
		name: 'Ревизор',
	},
	{
		code: 3,
		name: 'Травматолог',
	},
	{
		code: 2,
		name: 'Учёный-математик',
	},
	{
		code: 5,
		name: 'Кинорежиссёр',
	},
	{
		code: 3,
		name: 'Дознаватель',
	},
	{
		code: 4,
		name: 'Инкассатор',
	},
	{
		code: 3,
		name: 'Педиатр',
	},
	{
		code: 1,
		name: 'Пожарный',
	},
	{
		code: 1,
		name: 'Судовой электромеханик',
	},
	{
		code: 4,
		name: 'Главный бухгалтер',
	},
	{
		code: 6,
		name: 'Диджей',
	},
	{
		code: 2,
		name: 'Хранитель музейных фондов',
	},

	{
		code: 6,
		name: 'Корреспондент',
	},
	{
		code: 1,
		name: 'Взрывотехник',
	},
	{
		code: 2,
		name: 'Инженер садово-паркового хозяйства',
	},
	{
		code: 1,
		name: 'Океанолог',
	},
	{
		code: 1,
		name: 'Авиационный механик',
	},
	{
		code: 6,
		name: 'Реставратор произведений искусств',
	},
	{
		code: 4,
		name: 'Страховой агент',
	},
	{
		code: 6,
		name: 'Телеведущий',
	},
	{
		code: 3,
		name: 'Туристический агент',
	},
	{
		code: 4,
		name: 'Эксперт-оценщик имущества',
	},
	{
		code: 6,
		name: 'Архитектор',
	},
	{
		code: 5,
		name: 'Директор по финансам',
	},
	{
		code: 4,
		name: 'Офицер федеральной службы безопасности',
	},
	{
		code: 1,
		name: 'Проектировщик домов',
	},
	{
		code: 4,
		name: 'Контролёр качества технологического процесса',
	},
	{
		code: 6,
		name: 'Дизайнер интерьера',
	},
	{
		code: 3,
		name: 'Агент по недвижимости',
	},
	{
		code: 1,
		name: 'Инженер мобильной связи',
	},
	{
		code: 3,
		name: 'Логопед',
	},
	{
		code: 2,
		name: 'Лингвист-востоковед',
	},
	{
		code: 3,
		name: 'Преподаватель физико-математических наук',
	},
	{
		code: 5,
		name: 'Начальник отдела кадров',
	},
	{
		code: 6,
		name: 'Веб-дизайнер',
	},
	{
		code: 6,
		name: 'Обозреватель политических событий',
	},
	{
		code: 4,
		name: 'Аудитор',
	},
	{
		code: 5,
		name: 'Командир военной части',
	},
	{
		code: 2,
		name: 'Бактериолог',
	},
	{
		code: 5,
		name: 'Директор супермаркета',
	},
	{
		code: 5,
		name: 'Управляющий производством',
	},
	{
		code: 2,
		name: 'Ученый в области геологии',
	},
	{
		code: 3,
		name: 'Психоаналитик',
	},
	{
		code: 5,
		name: 'Главный инженер по строительству',
	},
	{
		code: 6,
		name: 'Журналист',
	},
	{
		code: 5,
		name: 'Директор театра',
	},
	{
		code: 4,
		name: 'Сотрудник ГИБДД',
	},
	{
		code: 4,
		name: 'Авиадиспетчер',
	},
	{
		code: 6,
		name: 'Артист в шоу-бизнесе',
	},
	{
		code: 1,
		name: 'Водитель транспортного средства',
	},
	{
		code: 1,
		name: 'Специалист по ремонту автомобилей',
	},
	{
		code: 5,
		name: 'Имиджмейкер',
	},
	{
		code: 3,
		name: 'Комментатор соревнований',
	},
	{
		code: 5,
		name: 'Штурман корабля',
	},
	{
		code: 5,
		name: 'Капитан корабля',
	},
	{
		code: 4,
		name: 'Программист',
	},
	{
		code: 5,
		name: 'Декан факультета',
	},
	{
		code: 5,
		name: 'Предприниматель',
	},
	{
		code: 6,
		name: 'Каскадер',
	},
	{
		code: 2,
		name: 'Научный сотрудник в области генетики',
	},
	{
		code: 3,
		name: 'Врач-терапевт',
	},
	{
		code: 2,
		name: 'Физик-ядерщик',
	},
]

export const test2 = [
	{ name: 'Узнавать об открытиях в области физики и математики.', object: 'Физика и математика' },
	'Смотреть передачи о жизни растений и животных.',
	'Выяснять устройство электроприборов.',
	'Читать научно-популярные технические журналы.',
	'Смотреть передачи о жизни людей в разных странах.',
	'Бывать на выставках, концертах, спектаклях.',
	'Обсуждать и анализировать события в стране и за рубежом.',
	'Наблюдать за работой медсестры, врача.',
	'Создавать уют и порядок в доме, классе, школе.',
	'Читать книги и смотреть фильмы о войнах и сражениях.',
	'Заниматься математическими расчётами и вычислениями.',
	'Узнавать об открытиях в области химии и биологии.',
	'Ремонтировать бытовые электроприборы.',
	'Посещать технические выставки, знакомиться с достижениями науки и техники.',
	'Ходить в походы, бывать в новых неизведанных местах.',
	'Читать отзывы и статьи о книгах, фильмах, концертах.',
	'Участвовать в общественной жизни школы, города.',
	'Объяснять одноклассникам учебный материал.',
	'Самостоятельно выполнять работу по хозяйству.',
	'Соблюдать режим, вести здоровый образ жизни.',
	'Проводить опыты по физике.',
	'Ухаживать за животными растениями.',
	'Читать статьи об электронике и радиотехнике.',
	'Собирать и ремонтировать часы, замки, велосипеды.',
	'Коллекционировать камни, минералы.',
	'Вести дневник, сочинять стихи и рассказы.',
	'Читать биографии известных политиков, книги по истории.',
	'Играть с детьми, помогать делать уроки младшим.',
	'Закупать продукты для дома, вести учёт расходов.',
	'Участвовать в военных играх, походах.',
	'Заниматься физикой и математикой сверх школьной программы.',
	'Замечать и объяснять природные явления.',
	'Собирать и ремонтировать компьютеры.',
	'Строить чертежи, схемы, графики, в том числе на компьютере.',
	'Участвовать в географических, геологических экспедициях.',
	'Рассказывать друзьям о прочитанных книгах, увиденных фильмах и спектаклях.',
	'Следить за политической жизнью в стране и за рубежом.',
	'Ухаживать за маленькими детьми или близкими, если они заболели.',
	'Искать и находить способы зарабатывания денег.',
	'Заниматься физической культурой и спортом.',
	'Участвовать в физико-математических олимпиадах.',
	'Выполнять лабораторные опыты по химии и биологии.',
	'Разбираться в принципах работы электроприборов.',
	'Разбираться в принципах работы различных механизмов.',
	'Читать географические и геологические карты.',
	'Участвовать в спектаклях, концертах.',
	'Изучать политику и экономику других стран.',
	'Изучать причины поведения людей, строение человеческого организма.',
	'Вкладывать заработанные деньги в домашний бюджет.',
	'Участвовать в спортивных соревнованиях.',
]
